In [2]:
import pandas as pd

# 1. Pandas Serisi Oluşturmak

In [3]:
#Seri default olarak indexli bir şekilde oluşur
pd.Series([10,20,30,40,50,60,75,82,95])

0    10
1    20
2    30
3    40
4    50
5    60
6    75
7    82
8    95
dtype: int64

In [4]:
seri = pd.Series([10,20,30,40,50,60,75,82,95])

In [5]:
type(seri)

pandas.core.series.Series

In [7]:
#index verisi
seri.axes

[RangeIndex(start=0, stop=9, step=1)]

In [9]:
#veri tipi
seri.dtype

dtype('int64')

In [11]:
#seri boyutu
seri.ndim

1

In [12]:
#seri genişliği
seri.size

9

In [14]:
#array şeklinde ulaşmak için
seri.values

array([10, 20, 30, 40, 50, 60, 75, 82, 95], dtype=int64)

In [20]:
#Serinin tepesini kontrol etme
seri.head(4)

0    10
1    20
2    30
3    40
dtype: int64

In [19]:
#serinin sonunu kontrol etme
seri.tail(3)

6    75
7    82
8    95
dtype: int64

### İndex İsimlendirme

In [27]:
pd.Series([99,22,321,65,49,15], index = ["a","b","c","d","e","f"])

a     99
b     22
c    321
d     65
e     49
f     15
dtype: int64

In [28]:
pd.Series([99,22,321,65,49,15], index = [0,2,4,6,8,10])

0      99
2      22
4     321
6      65
8      49
10     15
dtype: int64

In [29]:
seri = pd.Series([99,22,321,65,49,15], index = ["a","b","c","d","e","f"])

In [30]:
seri["a"]

99

In [31]:
seri["a":"c"]

a     99
b     22
c    321
dtype: int64

#### Sözlük Tipinde Liste Oluşturmak

In [32]:
sozluk = {"reg":10,"log":11,"cart":12}

In [34]:
seri = pd.Series(sozluk)

In [35]:
seri

reg     10
log     11
cart    12
dtype: int64

In [36]:
seri["log"]

11

#### İki seriyi birleştirme

In [37]:
pd.concat([seri,seri])

reg     10
log     11
cart    12
reg     10
log     11
cart    12
dtype: int64

# 2. Eleman Seçme İşlemleri

In [74]:
import numpy as np

In [4]:
a= np.array([1,2,33,444,75])
seri = pd.Series(a)
seri

0      1
1      2
2     33
3    444
4     75
dtype: int32

In [5]:
seri[0]

1

In [6]:
seri[0:3]

0     1
1     2
2    33
dtype: int32

In [7]:
seri = pd.Series([121,200,150,99], 
                 index = ["reg","loj","cart","rf"])

In [8]:
seri

reg     121
loj     200
cart    150
rf       99
dtype: int64

In [9]:
seri.index

Index(['reg', 'loj', 'cart', 'rf'], dtype='object')

In [11]:
seri.keys

<bound method Series.keys of reg     121
loj     200
cart    150
rf       99
dtype: int64>

In [12]:
list(seri.items())

[('reg', 121), ('loj', 200), ('cart', 150), ('rf', 99)]

In [13]:
seri.values

array([121, 200, 150,  99], dtype=int64)

#### Eleman Sorgulama

In [14]:
"reg"in seri

True

In [15]:
"a" in seri

False

In [16]:
seri["reg"]

121

#### Fancy Eleman

In [17]:
seri[["rf","reg"]]

rf      99
reg    121
dtype: int64

In [19]:
seri[["rf","reg"]] = 50
seri

reg      50
loj     200
cart    150
rf       50
dtype: int64

#### Slice İşlemleri

In [21]:
seri["reg":"cart"]

reg      50
loj     200
cart    150
dtype: int64

# 3. Pandas DataFrame Oluşturma

In [24]:
l = [1,2,39,65,85]
l

[1, 2, 39, 65, 85]

In [27]:
pd.DataFrame(l, columns = ["degisken_ismi"])

   degisken_ismi
0              1
1              2
2             39
3             65
4             85

In [33]:
m = np.random.randint(-255,255,(120,4))

In [34]:
m

array([[-178,  181, -204,   -9],
       [ 245, -241, -137,  149],
       [ -48,  200,    0,   37],
       [  25,  -57,   80, -220],
       [ 146,  126, -157,   27],
       [-222,  146,  101,  -50],
       [ 249, -103,  -43,  -57],
       [-108, -195,  103, -238],
       [  23,  171,   78,    2],
       [  93,  -93,   33,  141],
       [ -86,  170,  -42, -148],
       [-228,  111,  -76, -158],
       [-234, -214, -160,   87],
       [ 174, -166,   85,  237],
       [-149,  -44, -130,  142],
       [-121,   53, -194,  -40],
       [-126,  115,  115,   42],
       [ 185,   51,  -85,   58],
       [ -93, -250,  -71,   49],
       [  -3,    8, -152, -139],
       [ 131,  -92,  126,  213],
       [-247,  -96, -250,   55],
       [ 155, -137,  158,   56],
       [  53,   -6, -145,  150],
       [  47, -200,  223, -235],
       [ -56,   29,  111,  226],
       [ 176,  -43, -241,  102],
       [-115, -173,  -28,    9],
       [ 193,   22,  214,   43],
       [ -76,  182,  -57,   20],
       [-186,  114,  155, -191],
       [-127, -239,  203,    6],
       [ 193, -211,  -93,   60],
       [ -46,  214,  149, -169],
       [ 246,   58, -102, -152],
       [ 237,  181, -255,   63],
       [  85, -155, -197,  105],
       [ 122,  -65,   27,  -61],
       [ -41, -113, -196, -118],
       [  62, -157, -221,  231],
       [  79,  -66,  -73,  134],
       [  14,  165,    6,  -16],
       [  30,  108,   42, -234],
       [-142, -243,   80, -166],
       [-247, -113,  131,  122],
       [  67, -112, -173,  225],
       [-211,  216,  121, -116],
       [ -74,  152,  154,   98],
       [-202,  -52,  103,  -63],
       [ -46,  182,  212,  213],
       [ 163,  -83,  233,  245],
       [ -95, -109,  249,  -31],
       [-216,    2,  -42,  226],
       [ 194,   80,  -85, -215],
       [-223,   69,  211, -250],
       [ 232,   91,  -59,  -53],
       [ -89,  -11, -194, -126],
       [ -89,  145,  206,  100],
       [  84,  239, -213,  122],
       [-212,   28,  186,  173],
       [  40, -253,   -8,  158],
       [ 207, -135, -253,  -91],
       [ 248,  186,    1, -252],
       [  18, -186,   96, -118],
       [  51,  254, -192,  228],
       [  58,  -71,  243,  221],
       [  65,   -1,  203, -172],
       [  86, -161,  -57, -235],
       [ 245,  -10, -186, -159],
       [   1,  -60,  -11,  -71],
       [-195,   43,   36, -140],
       [ -36, -140, -196,  242],
       [ -82,   55,  -13,  251],
       [ 152,  212, -122,   99],
       [-213,   80,  103,  206],
       [-197,  232,   32,  201],
       [ 115,  242,   16,  -72],
       [ 100,   31,  253, -184],
       [ -86, -189, -153,  200],
       [ -58,   -6,  -48,   41],
       [ -31, -185,  -38,   76],
       [  84,  224,  146,   23],
       [ 103,  227,  -51,  176],
       [ 198,  192, -105,  211],
       [ 131,    3,  155,   76],
       [-111, -242, -144, -185],
       [ 241, -180,   -3,  -15],
       [-216,  169,   88, -151],
       [ -88, -183,  -78,  110],
       [  -2, -189,   78,  -10],
       [-238,   98,  249,  231],
       [-117, -176,  242,  141],
       [  11,  -21, -155,  -66],
       [-220,   16,  111,  -64],
       [ -12,  -13,  -18,  224],
       [ 137,  -17, -162,   78],
       [  43,  115,   83,  -67],
       [-158,  129,  243,  -39],
       [-134, -226,  179,  -94],
       [ 235,  155, -125, -113],
       [-239,  144,   -6, -107],
       [ 113,  -45,  -54,  182],
       [-197,  220,  218,  139],
       [  60, -175,  -99,  181],
       [-126, -254, -193, -241],
       [ 193,   39,  229,  187],
       [ -94, -183,   -8, -144],
       [-108, -230,   79,   78],
       [ 130,  179,  -82,  151],
       [-131,   98,  -26,  -26],
       [  30,  147, -128,  251],
       [  18,  246,  218,  192],
       [-150, -203,  231,  198],
       [ 197,  -95, -191,   81],
       [ -31,   45,  -93, -173],
       [  24, -194,  189,  178],
       [ 106,  147,  197,  133],
       [ -31,  223, -199,  -86],
       [ -83,    6,  119,  -31],
       [  95,   99,  177,   -5]])

In [38]:
df = pd.DataFrame(m, columns =["var1","var2","var3","var4"])
df

     var1  var2  var3  var4
0    -178   181  -204    -9
1     245  -241  -137   149
2     -48   200     0    37
3      25   -57    80  -220
4     146   126  -157    27
..    ...   ...   ...   ...
115    24  -194   189   178
116   106   147   197   133
117   -31   223  -199   -86
118   -83     6   119   -31
119    95    99   177    -5

[120 rows x 4 columns]

In [40]:
df.columns = ("deg1","deg2","deg3","deg4")

In [41]:
df

     deg1  deg2  deg3  deg4
0    -178   181  -204    -9
1     245  -241  -137   149
2     -48   200     0    37
3      25   -57    80  -220
4     146   126  -157    27
..    ...   ...   ...   ...
115    24  -194   189   178
116   106   147   197   133
117   -31   223  -199   -86
118   -83     6   119   -31
119    95    99   177    -5

[120 rows x 4 columns]

In [42]:
type(df)

pandas.core.frame.DataFrame

In [43]:
df.axes

[RangeIndex(start=0, stop=120, step=1),
 Index(['deg1', 'deg2', 'deg3', 'deg4'], dtype='object')]

In [44]:
df.shape

(120, 4)

In [45]:
df.ndim

2

In [46]:
df.size

480

In [48]:
#bu şekilde verileri çekince df olarak değil array olarak verileri getirdi
df.values

array([[-178,  181, -204,   -9],
       [ 245, -241, -137,  149],
       [ -48,  200,    0,   37],
       [  25,  -57,   80, -220],
       [ 146,  126, -157,   27],
       [-222,  146,  101,  -50],
       [ 249, -103,  -43,  -57],
       [-108, -195,  103, -238],
       [  23,  171,   78,    2],
       [  93,  -93,   33,  141],
       [ -86,  170,  -42, -148],
       [-228,  111,  -76, -158],
       [-234, -214, -160,   87],
       [ 174, -166,   85,  237],
       [-149,  -44, -130,  142],
       [-121,   53, -194,  -40],
       [-126,  115,  115,   42],
       [ 185,   51,  -85,   58],
       [ -93, -250,  -71,   49],
       [  -3,    8, -152, -139],
       [ 131,  -92,  126,  213],
       [-247,  -96, -250,   55],
       [ 155, -137,  158,   56],
       [  53,   -6, -145,  150],
       [  47, -200,  223, -235],
       [ -56,   29,  111,  226],
       [ 176,  -43, -241,  102],
       [-115, -173,  -28,    9],
       [ 193,   22,  214,   43],
       [ -76,  182,  -57,   20],
       [-186,  114,  155, -191],
       [-127, -239,  203,    6],
       [ 193, -211,  -93,   60],
       [ -46,  214,  149, -169],
       [ 246,   58, -102, -152],
       [ 237,  181, -255,   63],
       [  85, -155, -197,  105],
       [ 122,  -65,   27,  -61],
       [ -41, -113, -196, -118],
       [  62, -157, -221,  231],
       [  79,  -66,  -73,  134],
       [  14,  165,    6,  -16],
       [  30,  108,   42, -234],
       [-142, -243,   80, -166],
       [-247, -113,  131,  122],
       [  67, -112, -173,  225],
       [-211,  216,  121, -116],
       [ -74,  152,  154,   98],
       [-202,  -52,  103,  -63],
       [ -46,  182,  212,  213],
       [ 163,  -83,  233,  245],
       [ -95, -109,  249,  -31],
       [-216,    2,  -42,  226],
       [ 194,   80,  -85, -215],
       [-223,   69,  211, -250],
       [ 232,   91,  -59,  -53],
       [ -89,  -11, -194, -126],
       [ -89,  145,  206,  100],
       [  84,  239, -213,  122],
       [-212,   28,  186,  173],
       [  40, -253,   -8,  158],
       [ 207, -135, -253,  -91],
       [ 248,  186,    1, -252],
       [  18, -186,   96, -118],
       [  51,  254, -192,  228],
       [  58,  -71,  243,  221],
       [  65,   -1,  203, -172],
       [  86, -161,  -57, -235],
       [ 245,  -10, -186, -159],
       [   1,  -60,  -11,  -71],
       [-195,   43,   36, -140],
       [ -36, -140, -196,  242],
       [ -82,   55,  -13,  251],
       [ 152,  212, -122,   99],
       [-213,   80,  103,  206],
       [-197,  232,   32,  201],
       [ 115,  242,   16,  -72],
       [ 100,   31,  253, -184],
       [ -86, -189, -153,  200],
       [ -58,   -6,  -48,   41],
       [ -31, -185,  -38,   76],
       [  84,  224,  146,   23],
       [ 103,  227,  -51,  176],
       [ 198,  192, -105,  211],
       [ 131,    3,  155,   76],
       [-111, -242, -144, -185],
       [ 241, -180,   -3,  -15],
       [-216,  169,   88, -151],
       [ -88, -183,  -78,  110],
       [  -2, -189,   78,  -10],
       [-238,   98,  249,  231],
       [-117, -176,  242,  141],
       [  11,  -21, -155,  -66],
       [-220,   16,  111,  -64],
       [ -12,  -13,  -18,  224],
       [ 137,  -17, -162,   78],
       [  43,  115,   83,  -67],
       [-158,  129,  243,  -39],
       [-134, -226,  179,  -94],
       [ 235,  155, -125, -113],
       [-239,  144,   -6, -107],
       [ 113,  -45,  -54,  182],
       [-197,  220,  218,  139],
       [  60, -175,  -99,  181],
       [-126, -254, -193, -241],
       [ 193,   39,  229,  187],
       [ -94, -183,   -8, -144],
       [-108, -230,   79,   78],
       [ 130,  179,  -82,  151],
       [-131,   98,  -26,  -26],
       [  30,  147, -128,  251],
       [  18,  246,  218,  192],
       [-150, -203,  231,  198],
       [ 197,  -95, -191,   81],
       [ -31,   45,  -93, -173],
       [  24, -194,  189,  178],
       [ 106,  147,  197,  133],
       [ -31,  223, -199,  -86],
       [ -83,    6,  119,  -31],
       [  95,   99,  177,   -5]])

In [49]:
df.head()

   deg1  deg2  deg3  deg4
0  -178   181  -204    -9
1   245  -241  -137   149
2   -48   200     0    37
3    25   -57    80  -220
4   146   126  -157    27

In [50]:
df.tail()

     deg1  deg2  deg3  deg4
115    24  -194   189   178
116   106   147   197   133
117   -31   223  -199   -86
118   -83     6   119   -31
119    95    99   177    -5

## 3.1 DataFrame Eleman İşlemleri

In [51]:
import numpy as np
s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

In [52]:
sozluk = {"var1": s1, "var2":s2, "var3": s3}

In [53]:
sozluk

{'var1': array([9, 3, 3, 1, 8]),
 'var2': array([9, 1, 5, 5, 9]),
 'var3': array([7, 2, 8, 4, 4])}

In [55]:
df = pd.DataFrame(sozluk)
df

   var1  var2  var3
0     9     9     7
1     3     1     2
2     3     5     8
3     1     5     4
4     8     9     4

In [56]:
df[0:1]

   var1  var2  var3
0     9     9     7

In [57]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [58]:
df.index = ["a","b","c","d","e"]

In [59]:
df

   var1  var2  var3
a     9     9     7
b     3     1     2
c     3     5     8
d     1     5     4
e     8     9     4

In [62]:
df["c":"e"]

   var1  var2  var3
c     3     5     8
d     1     5     4
e     8     9     4

In [63]:
#silme (geçici)
df.drop("a",axis=0)

   var1  var2  var3
b     3     1     2
c     3     5     8
d     1     5     4
e     8     9     4

In [64]:
df

   var1  var2  var3
a     9     9     7
b     3     1     2
c     3     5     8
d     1     5     4
e     8     9     4

In [65]:
#kalıcı silme 
df.drop("a",axis=0, inplace= True)

In [66]:
df

   var1  var2  var3
b     3     1     2
c     3     5     8
d     1     5     4
e     8     9     4

In [67]:
#fancy silme
l = ["b","d"]

In [68]:
df.drop(l, axis = 0)

   var1  var2  var3
c     3     5     8
e     8     9     4

In [69]:
"var1" in df

True

In [70]:
l=["var1","var4","var2"]

In [71]:
for i in l:
    print(i in df)

True
False
True

In [72]:
df

   var1  var2  var3
b     3     1     2
c     3     5     8
d     1     5     4
e     8     9     4

In [73]:
df["var4"] = df["var1"]/df["var2"]

In [74]:
df

   var1  var2  var3      var4
b     3     1     2  3.000000
c     3     5     8  0.600000
d     1     5     4  0.200000
e     8     9     4  0.888889

In [75]:
l = ["var1","var2"]

In [76]:
df.drop(l,axis =1)

   var3      var4
b     2  3.000000
c     8  0.600000
d     4  0.200000
e     4  0.888889

In [77]:
df

   var1  var2  var3      var4
b     3     1     2  3.000000
c     3     5     8  0.600000
d     1     5     4  0.200000
e     8     9     4  0.888889

# 4. Gözlem ve Değişken Seçimi: loc & iloc

In [80]:
m = np.random.randint(1,100, size= (10,3))
df = pd.DataFrame(m, columns = ["var1","var2","var3"])
df

   var1  var2  var3
0    67    92     4
1    85    40     1
2    55    53    20
3    53    63    29
4    62     8    42
5    35    79    22
6    15    19    20
7    41    88    55
8    76     9    52
9    35    44    12

In [81]:
#loc: tanımlandığı şekli ile seçim yapmak için kullanılır.

In [82]:
df.loc[0:3] #3 dahil

   var1  var2  var3
0    67    92     4
1    85    40     1
2    55    53    20
3    53    63    29

In [83]:
#iloc: alışık olduğumuz indeksleme mantığı ile seçim yapar.

In [84]:
df.iloc[0:3] #3 dahil değil

   var1  var2  var3
0    67    92     4
1    85    40     1
2    55    53    20

In [85]:
df.iloc[:3,:2]

   var1  var2
0    67    92
1    85    40
2    55    53

In [86]:
df.loc[0:3,"var3"]

0     4
1     1
2    20
3    29
Name: var3, dtype: int32

In [ ]:
df.iloc[0:3,"var3"] #Hata verir ("var3") seçimi sebebiyle

In [87]:
df.iloc[0:3]["var3"]

0     4
1     1
2    20
Name: var3, dtype: int32

# 5. Koşullu Eleman İşlemleri

In [88]:
m = np.random.randint(1,100, size= (10,3))
df = pd.DataFrame(m, columns = ["var1","var2","var3"])
df

   var1  var2  var3
0    27    39    30
1    71    60    40
2    74    28    26
3     3    67    10
4     8    93    79
5    29    94     3
6    76    90    66
7    53    43    85
8    66    13    99
9    53    82    29

In [90]:
df["var1"]

0    27
1    71
2    74
3     3
4     8
5    29
6    76
7    53
8    66
9    53
Name: var1, dtype: int32

In [91]:
df["var1"][0:2]

0    27
1    71
Name: var1, dtype: int32

In [92]:
df[0:2]

   var1  var2  var3
0    27    39    30
1    71    60    40

In [93]:
df[0:2][["var1","var2"]]

   var1  var2
0    27    39
1    71    60

In [96]:
df.var1

0    27
1    71
2    74
3     3
4     8
5    29
6    76
7    53
8    66
9    53
Name: var1, dtype: int32

In [99]:
df[df.var1>30]

   var1  var2  var3
1    71    60    40
2    74    28    26
6    76    90    66
7    53    43    85
8    66    13    99
9    53    82    29

In [100]:
df[df.var1>30]["var2"]

1    60
2    28
6    90
7    43
8    13
9    82
Name: var2, dtype: int32

In [101]:
df[(df.var1>30)&(df.var2<60)]

   var1  var2  var3
2    74    28    26
7    53    43    85
8    66    13    99

In [103]:
#Hata verir df[(df.var1>30),["var1","var2"]]
df.loc[(df.var1>30),["var1","var2"]]

   var1  var2
1    71    60
2    74    28
6    76    90
7    53    43
8    66    13
9    53    82

# 6. DataFrame Birleştirme İşlemleri

In [109]:
m = np.random.randint(1,100, size= (5,3))
df1 = pd.DataFrame(m, columns = ["var1","var2","var3"])
df1

   var1  var2  var3
0    81     5    67
1    31    91    98
2    84    76    11
3    65    87     3
4    93    64    95

In [110]:
df2 = df1/2

In [111]:
df2

   var1  var2  var3
0  40.5   2.5  33.5
1  15.5  45.5  49.0
2  42.0  38.0   5.5
3  32.5  43.5   1.5
4  46.5  32.0  47.5

In [116]:
pd.concat([df1,df2], ignore_index= True)

   var1  var2  var3
0  81.0   5.0  67.0
1  31.0  91.0  98.0
2  84.0  76.0  11.0
3  65.0  87.0   3.0
4  93.0  64.0  95.0
5  40.5   2.5  33.5
6  15.5  45.5  49.0
7  42.0  38.0   5.5
8  32.5  43.5   1.5
9  46.5  32.0  47.5

In [119]:
df1.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [121]:
df2.columns = ["var1","var2","deg3"]

In [125]:
#farklı değişken isimlerine sahip dfleri birleştiriken sonuç aşağıdaki gibi olur.
pd.concat([df1,df2])

   var1  var2  var3  deg3
0  81.0   5.0  67.0   NaN
1  31.0  91.0  98.0   NaN
2  84.0  76.0  11.0   NaN
3  65.0  87.0   3.0   NaN
4  93.0  64.0  95.0   NaN
0  40.5   2.5   NaN  33.5
1  15.5  45.5   NaN  49.0
2  42.0  38.0   NaN   5.5
3  32.5  43.5   NaN   1.5
4  46.5  32.0   NaN  47.5

In [124]:
#Kesişim kümesi değişkenleri yansır.
pd.concat([df1,df2], join ="inner")

   var1  var2
0  81.0   5.0
1  31.0  91.0
2  84.0  76.0
3  65.0  87.0
4  93.0  64.0
0  40.5   2.5
1  15.5  45.5
2  42.0  38.0
3  32.5  43.5
4  46.5  32.0

In [130]:
#İstenilen dfnin değişkenlerine göre liste yansır.
#pd.concat([df1,df2], join_axes = [df1.columns]) #versiyon güncellemesi yedi
pd.concat([df1, df2]).reindex( columns = df1.columns)

   var1  var2  var3
0  81.0   5.0  67.0
1  31.0  91.0  98.0
2  84.0  76.0  11.0
3  65.0  87.0   3.0
4  93.0  64.0  95.0
0  40.5   2.5   NaN
1  15.5  45.5   NaN
2  42.0  38.0   NaN
3  32.5  43.5   NaN
4  46.5  32.0   NaN

In [133]:
pd.concat([df1,df2], ignore_index = 1).reindex(columns = df2.columns)

   var1  var2  deg3
0  81.0   5.0   NaN
1  31.0  91.0   NaN
2  84.0  76.0   NaN
3  65.0  87.0   NaN
4  93.0  64.0   NaN
5  40.5   2.5  33.5
6  15.5  45.5  49.0
7  42.0  38.0   5.5
8  32.5  43.5   1.5
9  46.5  32.0  47.5

# 7. İleri Birleştirme İşlemleri

#### 7.1 Birebir Birleştirme

In [4]:
df1 = pd.DataFrame({"çalışanlar":["Ali","Veli","Ayşe","Fatma"],
                   "grup": ["Muhasebe","Mühendislik","Mühendislik","İK"]})

df1

  çalışanlar         grup
0        Ali     Muhasebe
1       Veli  Mühendislik
2       Ayşe  Mühendislik
3      Fatma           İK

In [10]:
df2 = pd.DataFrame({"çalışanlar": ["Ayşe","Ali","Veli","Fatma"],
                   "ilk_giriş": [2010,2009,2014,2019]})

df2

  çalışanlar  ilk_giriş
0       Ayşe       2010
1        Ali       2009
2       Veli       2014
3      Fatma       2019

In [11]:
pd.merge(df1,df2)

  çalışanlar         grup  ilk_giriş
0        Ali     Muhasebe       2009
1       Veli  Mühendislik       2014
2       Ayşe  Mühendislik       2010
3      Fatma           İK       2019

In [12]:
pd.merge(df1,df2, on = "çalışanlar")

  çalışanlar         grup  ilk_giriş
0        Ali     Muhasebe       2009
1       Veli  Mühendislik       2014
2       Ayşe  Mühendislik       2010
3      Fatma           İK       2019

#### 7.2 Çoktan Teke Birleştirme (many2one)

In [13]:
df3=pd.merge(df1,df2)

In [14]:
df3

  çalışanlar         grup  ilk_giriş
0        Ali     Muhasebe       2009
1       Veli  Mühendislik       2014
2       Ayşe  Mühendislik       2010
3      Fatma           İK       2019

In [20]:
df4 = pd.DataFrame({"grup": ["Muhasebe","Mühendislik","İK"],
                   "müdür": ["Caner","Mustafa","Berkcan"]})

df4

          grup    müdür
0     Muhasebe    Caner
1  Mühendislik  Mustafa
2           İK  Berkcan

In [21]:
pd.merge(df3,df4)

  çalışanlar         grup  ilk_giriş    müdür
0        Ali     Muhasebe       2009    Caner
1       Veli  Mühendislik       2014  Mustafa
2       Ayşe  Mühendislik       2010  Mustafa
3      Fatma           İK       2019  Berkcan

#### 7.3 Çoktan Çoka Birleştirme (many2many)

In [22]:
df5 = pd.DataFrame({"grup": ["Muhasebe","Muhasebe","Mühendislik","Mühendislik","İK","İK"],
                   "yetenekler": ["matematik","excel","kodlama","linux","excel","yönetim"]})

df5

          grup yetenekler
0     Muhasebe  matematik
1     Muhasebe      excel
2  Mühendislik    kodlama
3  Mühendislik      linux
4           İK      excel
5           İK    yönetim

In [23]:
df1

  çalışanlar         grup
0        Ali     Muhasebe
1       Veli  Mühendislik
2       Ayşe  Mühendislik
3      Fatma           İK

In [24]:
pd.merge(df1,df5)

  çalışanlar         grup yetenekler
0        Ali     Muhasebe  matematik
1        Ali     Muhasebe      excel
2       Veli  Mühendislik    kodlama
3       Veli  Mühendislik      linux
4       Ayşe  Mühendislik    kodlama
5       Ayşe  Mühendislik      linux
6      Fatma           İK      excel
7      Fatma           İK    yönetim

# 8. Toplulaştırma ve Gruplama (Aggregation & Grouping)

Basit topluluaştırma fonksiyonları:

* count()
* first()
* last()
* mean ()
* median()
* min()
* max()
* std()
* var()
* sum()

In [31]:
import seaborn as sns

In [34]:
#https://github.com/mwaskom/seaborn-data
?sns.load_dataset

In [35]:
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [37]:
df.shape

(1035, 6)

In [45]:
df.mean()

C:\Users\abdul\AppData\Local\Temp\ipykernel_1492\3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [46]:
df.mean(numeric_only=True)

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [47]:
df["mass"].mean()

2.6381605847953233

In [48]:
df["mass"].count()

513

In [50]:
df["mass"].min()

0.0036

In [51]:
df["mass"].max()

25.0

In [52]:
df["mass"].sum()

1353.37638

In [53]:
df["mass"].std()

3.8186166509616046

In [54]:
df["mass"].var()

14.58183312700122

In [57]:
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [59]:
df.describe().T #Transpozesi

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [61]:
df.dropna().describe().T #Boşlukları sildim

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

## 8.1 Gruplama İşlemleri

In [62]:
df = pd.DataFrame({"gruplar": ["A","B","C","A","B","C"],
                  "veri": [10,11,52,23,43,55]})
df

  gruplar  veri
0       A    10
1       B    11
2       C    52
3       A    23
4       B    43
5       C    55

In [63]:
df.groupby("gruplar")

In [65]:
df.groupby("gruplar").mean()

         veri
gruplar
A        16.5
B        27.0
C        53.5

In [66]:
df.groupby("gruplar").sum()

         veri
gruplar
A          33
B          54
C         107

In [67]:
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [69]:
df.groupby("method")["orbital_period"].mean()

method
Astrometry                            NaN
Eclipse Timing Variations        5.125000
Imaging                               NaN
Microlensing                          NaN
Orbital Brightness Modulation         NaN
Pulsar Timing                         NaN
Pulsation Timing Variations           NaN
Radial Velocity                  2.630699
Transit                          1.470000
Transit Timing Variations             NaN
Name: mass, dtype: float64

In [71]:
# !!!! ANLAMLI VERİ: uzaklığına göre gezegenlerin bulunma yöntemleri
df.groupby("method")["distance"].mean()

method
Astrometry                         17.875000
Eclipse Timing Variations         315.360000
Imaging                            67.715937
Microlensing                     4144.000000
Orbital Brightness Modulation    1180.000000
Pulsar Timing                    1200.000000
Pulsation Timing Variations              NaN
Radial Velocity                    51.600208
Transit                           599.298080
Transit Timing Variations        1104.333333
Name: distance, dtype: float64

# 9. İleri Toplulaştırma İşlemleri (Aggregate, filter, transform, apply)

In [72]:
df = pd.DataFrame({"gruplar": ["A","B","C","A","B","C"],
                  "degisken1": [10,23,33,22,11,99],
                  "degisken2": [100,253,333,262,111,969]})

df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

#### 9.1 Aggregate İşlemi

In [73]:
df.groupby("gruplar").mean()

         degisken1  degisken2
gruplar
A             16.0      181.0
B             17.0      182.0
C             66.0      651.0

In [116]:
df.groupby("gruplar").aggregate("mean")

         degisken1  degisken2
gruplar
A             16.0      181.0
B             17.0      182.0
C             66.0      651.0

In [78]:
df.groupby("gruplar").aggregate(["min",np.median, "max"])

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10   16.0  22       100  181.0  262
B              11   17.0  23       111  182.0  253
C              33   66.0  99       333  651.0  969

In [79]:
df.groupby("gruplar").aggregate({"degisken1": "min","degisken2":"max"})

         degisken1  degisken2
gruplar
A               10        262
B               11        253
C               33        969

#### 9.2 Filter İşlemi

In [80]:
def filter_func(x):
    return x["degisken1"].std()>9

In [83]:
#Standart Sapma
df.groupby("gruplar").std()

         degisken1   degisken2
gruplar
A         8.485281  114.551299
B         8.485281  100.409163
C        46.669048  449.719913

In [81]:
df.groupby("gruplar").filter(filter_func)

  gruplar  degisken1  degisken2
2       C         33        333
5       C         99        969

#### 9.3 Transform İşlemi

In [86]:
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [87]:
df["degisken1"]*9

0     90
1    207
2    297
3    198
4     99
5    891
Name: degisken1, dtype: int64

In [88]:
df_a = df.iloc[:,1:3]

In [90]:
#transform sayesinde lambda fonksiyonuyla her değişkenden, sütunun ortalamasını çıkaran vektörel olarak çalışan bir kod yazdım.
df_a.transform(lambda x:x-x.mean())

   degisken1  degisken2
0      -23.0     -238.0
1      -10.0      -85.0
2        0.0       -5.0
3      -11.0      -76.0
4      -22.0     -227.0
5       66.0      631.0

In [92]:
df_a.transform(lambda x:(x-x.mean())/ x.std())

   degisken1  degisken2
0  -0.687871  -0.738461
1  -0.299074  -0.263736
2   0.000000  -0.015514
3  -0.328982  -0.235811
4  -0.657963  -0.704331
5   1.973890   1.957853

#### 9.4 Apply İşlemi

In [97]:
df_yeni = df.iloc[:,1:3]
df_yeni

   degisken1  degisken2
0         10        100
1         23        253
2         33        333
3         22        262
4         11        111
5         99        969

In [100]:
df_yeni.apply(np.sum)

degisken1     198
degisken2    2028
dtype: int64

In [101]:
df_yeni.apply(np.mean)

degisken1     33.0
degisken2    338.0
dtype: float64

# 10. Pivot Tablolar

In [114]:
titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [106]:
titanic.groupby("sex")[["survived"]].mean()

        survived
sex
female  0.742038
male    0.188908

In [107]:
titanic.groupby("class")[["survived"]].mean()

        survived
class
First   0.629630
Second  0.472826
Third   0.242363

In [111]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean")

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

In [118]:
#ilk değişken veri, index satır, columns sütun şeklinde kolay tablo oluşturur.
titanic.pivot_table("survived", index = "sex", columns = "class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [131]:
age = pd.cut(titanic["age"],[0,18,35,60,100])
age.head(10)

0    (18.0, 35.0]
1    (35.0, 60.0]
2    (18.0, 35.0]
3    (18.0, 35.0]
4    (18.0, 35.0]
5             NaN
6    (35.0, 60.0]
7     (0.0, 18.0]
8    (18.0, 35.0]
9     (0.0, 18.0]
Name: age, dtype: category
Categories (4, interval[int64, right]): [(0, 18] < (18, 35] < (35, 60] < (60, 100]]

In [132]:
titanic.pivot_table("survived",["sex",age],"class")

class                First    Second     Third
sex    age
female (0, 18]    0.909091  1.000000  0.511628
       (18, 35]   0.972222  0.925000  0.500000
       (35, 60]   0.972222  0.850000  0.142857
       (60, 100]  1.000000       NaN  1.000000
male   (0, 18]    0.800000  0.600000  0.215686
       (18, 35]   0.500000  0.074074  0.155844
       (35, 60]   0.370370  0.037037  0.068182
       (60, 100]  0.083333  0.333333  0.000000

# 11. Dış Kaynaklı Veri Okuma

In [135]:
#csv okuma
pd.read_csv("reading_data/ornekcsv.csv")

       a;b;c
0    78;12;1
1    78;12;2
2   78;324;3
3      7;2;4
4    88;23;5
5       6;2;
6    56;11;6
7     7;12;7
8    56;21;7
9    346;2;8
10     5;1;8
11  456;21;8
12   3;12;88

In [136]:
pd.read_csv("reading_data/ornekcsv.csv", sep = ";")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [138]:
#txt okuma
pd.read_csv("reading_data/duz_metin.txt")

    1 2
0   2 2
1   3 2
2   4 2
3   5 2
4   6 2
5  7 2
6   8 2
7   9 2
8  10 2

In [139]:
#excel okuma
pd.read_excel("reading_data/ornekx.xlsx")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [140]:
df = pd.read_excel("reading_data/ornekx.xlsx")

In [141]:
df.head()

    a    b    c
0  78   12  1.0
1  78   12  2.0
2  78  324  3.0
3   7    2  4.0
4  88   23  5.0

In [142]:
df.columns = ("A","B","C")

In [145]:
df.head()

    A    B    C
0  78   12  1.0
1  78   12  2.0
2  78  324  3.0
3   7    2  4.0
4  88   23  5.0

In [147]:
#İnternetten csv çekme
pd.read_csv("https://raw.githubusercontent.com/mwaskom/seaborn-data/master/tips.csv")

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]